app/Controllers/Admin/User.php

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
    public function index()
    {
        $session = session();
        $userId = $session->get('user')['id'];

        // Fetch the user data from the database
        $user = (object)$this->authModel->find($userId);